#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_zone.lojzatv_cz: Refreshing state... [id=303d28fa62af4ae718b995d81826b16f]
cloudflare_zone.kozeltv_cz: Refreshing state... [id=50251f952189c4a427154677dc88057c]
cloudflare_zone.sdhveselice_cz: Refreshing state... [id=8eba2604d6382a951f07948621f2e0d3]
cloudflare_zone.kozak_in: Refreshing state... [id=7e83bba5abbc13ea023d9a93f9fbe16c]
cloudflare_zone.talko_cz: Refreshing state... [id=88f39cacb5ad1001d7bea4599217044b]
google_container_registry.registry: Refreshing state... [id=eu.artifacts.webz-346616.appspot.com]
google_service_account.playground_veselice: Refreshing state... [id=projects/webz-346616/serviceAccounts/cloudrun-playground-veselice@webz-346616.iam.gserviceaccount.com]
google_service_account.miluji_praci: Refreshing state... [id=projects/webz-346616/serviceAccounts/cloudrun-miluji-praci@webz-346616.iam.gserviceaccount.com]
cloudflare_record.kozak_in_miluji_praci_old: Refreshing state... [id=88e3b6b56127062a785ca2bedcbd900c]
cloudflare_record.kozak_in_ip_v4: Refreshing state... [id=aef3bc4f99249c1bb1b0cf3d06238621]
cloudflare_record.kozak_in_spf: Refreshing state... [id=df8e87c2ae502a956e4d609061ba9d5a]
cloudflare_record.kozak_in_mx_1: Refreshing state... [id=a0723f22226ed5010bcbc67582fd0d8f]
cloudflare_record.kozak_in_push_gateway: Refreshing state... [id=3b62f3d04cd34cd17992e9b0793bb207]
cloudflare_record.kozak_in_mx_2: Refreshing state... [id=43b29e5450cfa3f1683c93cd0c531e79]
cloudflare_record.kozak_in_alertmanager: Refreshing state... [id=b7dece37df4a1c26971ce52ee44b0e39]
cloudflare_record.kozak_in_miluji_praci: Refreshing state... [id=fc5b0a20ae4ef5bd1b0de7c8e30689fc]
cloudflare_record.kozak_in_ip_v6: Refreshing state... [id=a6cf917b897f54bbaa29ce7950fe7535]
cloudflare_record.kozak_in_prom: Refreshing state... [id=0147b142dd0fb9bafc9a479beadbab25]
cloudflare_record.kozak_in_google_verification: Refreshing state... [id=7510741dbb637307a4ddc5185580a0c9]
cloudflare_record.kozak_in_grafana: Refreshing state... [id=7bf6fe61000ef6a351724fb7605e3f70]
google_project_iam_binding.playground_veselice: Refreshing state... [id=webz-346616/roles/datastore.user]
google_cloud_run_service.playground_veselice: Refreshing state... [id=locations/europe-west1/namespaces/webz-346616/services/playground-veselice]
google_cloud_run_service.miluji_praci: Refreshing state... [id=locations/europe-west1/namespaces/webz-346616/services/miluji-praci-fusakla]
cloudflare_record.lojzatv_cz_ip_v4: Refreshing state... [id=b0b40def20f6af62419b61808656e84d]
cloudflare_record.lojzatv_cz_ip_v6: Refreshing state... [id=3ff2195ed41ed67bb83293d4be0b39f9]
cloudflare_record.kozeltv_cz_ip_v6: Refreshing state... [id=a9fd6605443e685fd5761d6eca51262c]
cloudflare_record.kozeltv_cz_ip_v4: Refreshing state... [id=51a4de5c468cb0519203e5fc6791975b]
cloudflare_record.sdhveselice_cz_mx_2: Refreshing state... [id=57af236cc96f125e44d26979ed9f5368]
cloudflare_record.sdhveselice_cz_mx_1: Refreshing state... [id=4e360e0d19c9698167c1c159c9bf6214]
cloudflare_record.sdhveselice_cz_www_v4: Refreshing state... [id=1ab6a65f3500b3556490c6214733f06b]
cloudflare_record.sdhveselice_cz: Refreshing state... [id=e57973ae25404a0271f8720baf0d4d22]
cloudflare_record.talko_cz_dmarc: Refreshing state... [id=271f604ccf4bb207f8c069532415d65c]
cloudflare_record.talko_cz_ip_v6: Refreshing state... [id=facb628394deaf5af5eaafbe0e7ab0d6]
cloudflare_record.talko_cz_mx_1: Refreshing state... [id=ec11849c60860a684c323aa1616e1e5f]
cloudflare_record.talko_cz_ip_v4: Refreshing state... [id=ff62aec6d0aa46982f22ffae0716ca32]
cloudflare_record.talko_cz_spf: Refreshing state... [id=47b080b2a226313c71d0cedea87fe206]
cloudflare_record.talko_cz_mx_2: Refreshing state... [id=4ef95e764a8a8f2887c94c4f21d74abe]
google_cloud_run_service_iam_member.playground_veselice: Refreshing state... [id=v1/projects/webz-346616/locations/europe-west1/services/playground-veselice/roles/run.invoker/allUsers]
google_cloud_run_service_iam_member.miluji_praci: Refreshing state... [id=v1/projects/webz-346616/locations/europe-west1/services/miluji-praci-fusakla/roles/run.invoker/allUsers]
google_cloud_run_domain_mapping.miluji_praci_kozak_in: Refreshing state... [id=locations/europe-west1/namespaces/webz-346616/domainmappings/milujipraci.kozak.in]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_zone.kozak_in will be updated in-place
  ~ resource "cloudflare_zone" "kozak_in" {
      - account_id          = "6dce888ff2829565506648b8be9cdab3" -> null
        id                  = "7e83bba5abbc13ea023d9a93f9fbe16c"
        # (8 unchanged attributes hidden)
    }

  # cloudflare_zone.kozeltv_cz will be updated in-place
  ~ resource "cloudflare_zone" "kozeltv_cz" {
      - account_id          = "6dce888ff2829565506648b8be9cdab3" -> null
        id                  = "50251f952189c4a427154677dc88057c"
        # (8 unchanged attributes hidden)
    }

  # cloudflare_zone.lojzatv_cz will be updated in-place
  ~ resource "cloudflare_zone" "lojzatv_cz" {
      - account_id          = "6dce888ff2829565506648b8be9cdab3" -> null
        id                  = "303d28fa62af4ae718b995d81826b16f"
        # (8 unchanged attributes hidden)
    }

  # cloudflare_zone.sdhveselice_cz will be updated in-place
  ~ resource "cloudflare_zone" "sdhveselice_cz" {
      - account_id          = "6dce888ff2829565506648b8be9cdab3" -> null
        id                  = "8eba2604d6382a951f07948621f2e0d3"
        # (8 unchanged attributes hidden)
    }

  # cloudflare_zone.talko_cz will be updated in-place
  ~ resource "cloudflare_zone" "talko_cz" {
      - account_id          = "6dce888ff2829565506648b8be9cdab3" -> null
        id                  = "88f39cacb5ad1001d7bea4599217044b"
        # (8 unchanged attributes hidden)
    }

  # google_cloud_run_service.lesempolem_backend will be created
  + resource "google_cloud_run_service" "lesempolem_backend" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "lesempolem-backend"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/ingress"        = "all"
              + "run.googleapis.com/ingress-status" = "all"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = "webz-346616"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "3"
                  + "autoscaling.knative.dev/minScale" = "0"
                  + "run.googleapis.com/client-name"   = "terraform"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 5

              + containers {
                  + image = "eu.gcr.io/webz-346616/kotrzina/lesempolem-backend@sha256:1de2e94695170cd892d8adddf77f42a5750111eac0386b1235be4d0db5d81fe7"

                  + env {
                      + name  = "GOOGLE_FIRESTORE_COLLECTION_PREFIX"
                      + value = "lesempolem-backend"
                    }
                  + env {
                      + name  = "GOOGLE_PROJECT_ID"
                      + value = "webz-346616"
                    }

                  + ports {
                      + container_port = 8080
                      + name           = "http1"
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "128Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_member.lesempolem_backend will be created
  + resource "google_cloud_run_service_iam_member" "lesempolem_backend" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "lesempolem-backend"
    }

  # google_project_iam_binding.lesempolem_backend will be created
  + resource "google_project_iam_binding" "lesempolem_backend" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "webz-346616"
      + role    = "roles/datastore.user"
    }

  # google_service_account.lesempolem_backend will be created
  + resource "google_service_account" "lesempolem_backend" {
      + account_id   = "cloudrun-lesempolem-backend"
      + disabled     = false
      + display_name = "SA for lesempolem-backend cloud run"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 4 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  + lesempolem_backend_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kozaktomas, Action: `pull_request`*